Repository: NaN-tic/trytond-account_statement_enable_banking
Catalog: locale/*.po
Languages: ca, es

# model:ir.message,text:msg_connection_test_error
source: Error testing connection: %(error_message)s
ca: S'ha produït un error provant la connexió: %(error_message)s
es: Se ha producido un error probando la conexión: %(error_message)s

# model:ir.message,text:msg_connection_test_ok
source: Connection test successful.
ca: El test de connexió ha funcionat correctament.
es: El test de conexión ha funcionado correctamente.

# model:ir.message,text:msg_currency_not_match
source: The bank statements currency and the journal currency dosen't match.
ca: La moneda dels extractes bancaris no coincideix amb la moneda del diari.
es: La moneda de los extractos bancarios no coincide con la moneda del diario.

# model:ir.message,text:msg_error_create_session
source: Error creating the session: "%(error_code)s" "%(error_message)s"
ca: S'ha produït un error mentre s'intentava crear la sessió: "%(error_code)s" "%(error_message)s"
es: Se ha producido un error mientras se intentaba crear la sesión: "%(error_code)s" "%(error_message)s"

# model:ir.message,text:msg_error_get_statements
source: Error getting statements: "%(error_code)s" "%(error_message)s"
ca: S'ha produït un error mentre s'intentava obtenir les línies d'extracte: "%(error_code)s" "%(error_message)s"
es: Se ha producido un error mientras se intentaba obtener las líneas de extracto: "%(error_code)s" "%(error_message)s"

# model:ir.message,text:msg_find_same_related_to
source: You are post for two or more origins that are linked to lines with the same related (%(related_to)s) record and sum more than the related to amount. Please post for only one origin.
es: Estas contabilizando dos o más orígenes vinculados a líneas con el mismo registro selacionado (%(related_to)s) y cuya suma es mayor que la cantidad relacionada. Publica solo para un origen.

# model:ir.message,text:msg_journal_weight_unique
source: Weight Type must be unique per journal.
ca: El tipus de pes ha de ser únic per diari.
es: El tipo de peso debe ser único por diario.

# model:ir.message,text:msg_missing_fernet_key
source: Missing Fernet key.
ca: Falta la clau Fernet.
es: Falta clave Fernet.

# model:ir.message,text:msg_no_bank_account
source: No bank account found in journal, if you want to synchronize statements, you need to set a bank account.
ca: No s'ha trobat un compte bancari en el diari, si vols sincronitzar extractes, necessites indicar un compte bancari.
es: No se ha encontrado una cuenta bancaria en el diario, si quieres sincronizar extractos, necesitas indicar una cuenta bancaria.

# model:ir.message,text:msg_no_country
source: Country not found in bank party, please, make sure the bank party have at least one address with country.
ca: No s'ha trobat un país al tercer del banc, si us plau, assegurat que el tercer del banc té almenys una direcció amb país.
es: No se ha encontrado un país en el tercero del banco, por favor, asegúrese que el tercero del banco tiene al menos una dirección con país.

# model:ir.message,text:msg_no_session
source: Session not found.
ca: Sessió no trobada.
es: Sesión no encontrada

# model:ir.message,text:msg_not_enough_amount_to_pay
source: The invoice has not enougth amount to pay. It's %(amount_to_pay)s € and the origins selected sum %(origins_amount)s €.
ca: La factura no té prou import per pagar. Són %(amount_to_pay)s € i els orígens seleccionats sumen %(origins_amount)s €.
es: La factura no tiene suficiente importe a pagar. Son %(amount_to_pay)s € y el origen seleccionado suma %(origins_amount)s €.

# model:ir.message,text:msg_not_use_blocked_account_move
source: The suggestion you are trying to use adds move line(s) "%(move_lines)s" whose payments are blocked. Are you sure you want to continue?
ca: El suggeriment que intentes utilitzar afegeix la línia o línies de moviment "%(move_lines)s" els pagaments de la qual estan bloquejats. Segur que vols continuar?
es: La sugerencia que intentas usar añade las líneas de movimiento "%(move_lines)s" cuyos pagos están bloqueados. ¿Estás seguro de que deseas continuar?

# model:ir.message,text:msg_origin_line_with_move
source: The line has move "%(move)s" related to it. Cancel or delete the line will delete that move. Do you want to continue?
ca: La línia té l'assentament "%(move)s" relacionat. Cancel·lar o suprimir la línia suprimirà aquest moviment. Voleu continuar?
es: La línea tiene el asiento "%(move)s" relacionado. Cancelar o eliminar la línea eliminará este asiento. ¿Quieres continuar?

# model:ir.message,text:msg_origin_lines_with_move
source: The lines "%(lines)s" has moves related to it. Cancel or delete lines will delete those moves. Do you want to continue?
es: Las líneas "%(lines)s" tiene asientos relacionados. Cancelar o eliminar las líneas eliminaran estos asientos. ¿Quieres continuar?

# model:ir.message,text:msg_origin_pending_amount
source: The origin could not be reconciled because the amount of the lines "%(line_amount)s" and the amount of the origin "%(origin_amount)s" differ.
ca: L'orígen no es s'ha pogut conciliar perquè el total de les línies "%(line_amount)s" i el de l'origen "%(origin_amount)s" són diferents.
es: El origen no se pudo conciliar porque el total de las líneas "%(line_amount)s" y el del origen "%(origin_amount)s" son distintos.

# model:ir.message,text:msg_origins_with_lines
source: The origins "%(origins)s" have lines. If you want to use them to pay an Invoice, the related lines will be removed.
es: Los origenes "%(origins)s" tienen líneas. Si desea usarlos para pagar una factura, se eliminaran estas líneas.

# model:ir.message,text:msg_repeated_related_to_used
source: The related "%(related_to)s" is usde in a line of the posted origin "%(origin)s."
ca: El relacionat "%(related_to)s" s'utilitza en una línia de l'origen comptabilitzat "%(origin)s".
es: El relacionado "%(related_to)s" se utiliza en una línea del origen contabilizado "%(origin)s".

# model:ir.message,text:msg_statement_line_delete
source: It is not possible to remove the line "%(line)s", because the related statement "%(statement)s" is validated or posted.
es: No es posible eliminar la línea "%(line)s", porque el extracto relacionado "%(statement)s" está validado o contabilizado.

# model:ir.message,text:msg_suggested_line_related_to_statement_line
source: There is some suggested line relate to the statement lines of the origins "%(origins_name)s". Befeore make a new search, remove the statement line.
ca: Hi ha alguna línia suggerida relacionada amb les línies dels origen "%(origins_name)s". Abans de fer una cerca nova, elimineu les línies.
es: Hay alguna línea sugerida relacionada con las líneas de los orígenes "%(origins_name)s". Antes de realizar una nueva búsqueda, elimine las líneas.

# model:ir.message,text:msg_valid_days_out_of_range
source: The Enable Banking Session Valid Days fields must be between 1 and 90 days.
ca: El camp Dies validesa sessió Enable Banking han de tenir entre 1 i 90 dies.
es: El campo Dias validez sesión Enable Banking tiene que tener entre 1 y 90 días.

# model:ir.model.button,string:evaluate_weights_button
source: Evaluate Weights
es: Evaluar pesos

# model:ir.model.button,string:retrieve_enable_banking_session_button
source: Retrieve EB Session
ca: Recuperar Sessió EB
es: Recuperar sesión EB

# model:ir.model.button,string:retrieve_session_enable_banking_button
source: Synchronize Statement Enable Banking
ca: Sincronitza extracte Enable Banking
es: Sincronizar extractos Enable Banking

# model:ir.model.button,string:statement_line_add_pending_button
source: Add Pending
ca: Afegeix pendent
es: Añadir pendiente

# model:ir.model.button,string:statement_line_multiple_invoices_button
source: Add Invoices
ca: Afegeix factures
es: Añadir facturas

# model:ir.model.button,string:statement_line_multiple_move_lines_button
source: Add Move Lines
ca: Afegeix apunts comptables
es: Añadir apuntes contables

# model:ir.model.button,string:statement_origin_cancel_button
source: Cancel
ca: Cancel·la
es: Cancelar

# model:ir.model.button,string:statement_origin_link_invoice_button
source: Link Invoice
ca: Enllaça factura
es: Enlaza factura

# model:ir.model.button,string:statement_origin_post_button
source: Post
ca: Comptabilitza
es: Contabilizar

# model:ir.model.button,string:statement_origin_register_button
source: Register
ca: Registra
es: Registrar

# model:ir.model.button,string:statement_origin_search_suggestions_button
source: Search Suggestions
ca: Cerca Suggeriments
es: Busca Sugerencias

# model:ir.model.button,string:statement_origin_suggested_line_propose_button
source: Propose
ca: Proposa
es: Propone

# model:ir.model.button,string:statement_origin_suggested_line_use_button
source: Use
ca: Utilitza
es: Usa

# model:ir.model.button,string:statement_register_button
source: Register
ca: Registra
es: Registrar

# model:ir.model.button,string:synchronize_statement_enable_banking_button
source: Syncronize Statements
ca: Sincronitzar extractes
es: Sincronizar extractos

# model:ir.model.button,string:test_connection_enable_banking_configuration_button
source: Test Connection
ca: Test de connexió
es: Prueba de conexión

# model:ir.sequence,name:sequence_account_statement_origin
source: Account Statement Origin
ca: Origen Extracte
es: Origen Extracto

# model:ir.sequence.type,name:sequence_type_account_statement_origin
source: Account Statement Origin
ca: Origen Extracte
es: Origen Extracto

# model:ir.ui.menu,name:menu_enable_banking_configuration_form
source: Enable Banking Configuration
ca: Configuració Enable Banking
es: Configuración

# model:ir.ui.menu,name:menu_enable_banking_session_form
source: Enable Banking Session
ca: Sessió Enable Banking
es: Sesión Enable Banking

# model:ir.ui.menu,name:menu_statement_form
source: Statement Origins
ca: Origens d'extracte
es: Origenes de extracto

# model:statement.link.invoice.start,name:
source: Link Invoice Start
ca: Inici enllaça factura
es: Inicio enlaza factura

# report:enable_banking.session_ko:
source: Please. Try to create the session again later.
ca: Si us plau. Prova de crear la sessió de nou més tard.
es: Por favor. Prueba a crear la sesión de nuevo más tarde.

# report:enable_banking.session_ko:
source: Session creating failed
ca: La creació de la sessió ha fallat
es: La creación de la sesión ha fallado

# report:enable_banking.session_ko:
source: Session creating failed.
ca: La creació de la sessió ha fallat.
es: La creación de la sesión ha fallado.

# report:enable_banking.session_ok:
source: Now, you can close this window and go back to Tryton.
ca: Ara pots tancar aquesta finestra i tornar al Tryton.
es: Ahora, puedes cerrar esta ventana y volver a Tryton.

# report:enable_banking.session_ok:
source: Session created successfully.
ca: Sessió creada amb èxit.
es: Sesión creada con éxito.

# report:enable_banking.session_ok:
source: The session between enable banking and your bank has been created successfully.
ca: La sessió entre Enable Banking i el teu banc s'ha creat amb èxit.
es: La sesión entre Enable Banking y tu banco se ha creado con éxito.

# selection:account.statement,state:
source: Registered
ca: Registrat
es: Registrado

# selection:account.statement.journal.weight,type:
source: Based On Match
ca: Coincidencia de Basat en
es: Coincidencia Basado en

# selection:account.statement.journal.weight,type:
source: Combination Escape Threshold
ca: Llindar d'escapament combinat
es: Umbral de escape combinado

# selection:account.statement.journal.weight,type:
source: Date Match
ca: Coincidència de dates
es: Coincidencia de fechas

# selection:account.statement.journal.weight,type:
source: Escape Threshold
ca: Llindar d'escapament
es: Umbral de escape

# selection:account.statement.journal.weight,type:
source: Max Suggestion Count
es: Número máximo de sugerencias

# selection:account.statement.journal.weight,type:
source: Move Line Max Count
es: Número máximo de apuntes

# selection:account.statement.journal.weight,type:
source: Number Match
ca: Coincidència de número
es: Coincidencia de números

# selection:account.statement.journal.weight,type:
source: Origin Delta Days
es: Días de diferencia de origen

# selection:account.statement.journal.weight,type:
source: Origin Similarity
ca: Similitud d'origen
es: Similitud con origen

# selection:account.statement.journal.weight,type:
source: Origin Similarity Threshold
ca: Llindar de similitud d'origen
es: Umbral de similitud con origen

# selection:account.statement.journal.weight,type:
source: Party Match
ca: Coincidència de tercer
es: Coincidencia de tercero

# selection:account.statement.journal.weight,type:
source: Target Combinations
es: Combinaciones Objetivo

# selection:account.statement.journal.weight,type:
source: Type Balance
ca: Tipus saldo
es: Tipo saldo

# selection:account.statement.journal.weight,type:
source: Type Balance Invoice
ca: Tipus saldo factura
es: Tipo factura con saldo

# selection:account.statement.journal.weight,type:
source: Type Combination All
ca: Tipus combinació de tot
es: Tipo combinación con todos

# selection:account.statement.journal.weight,type:
source: Type Combination Party
ca: Tipus combinació de tercer
es: Tipo combinación de terceros

# selection:account.statement.journal.weight,type:
source: Type Origin
ca: Tipus origen
es: Tipo origen

# selection:account.statement.journal.weight,type:
source: Type Payment
ca: Tipus pagament
es: Tipo pago

# selection:account.statement.journal.weight,type:
source: Type Payment Group
ca: Tipus grup de pagament
es: Tipo grupo de pago

# selection:account.statement.journal.weight,type:
source: Type Sale
es: Tipo Venta

# selection:account.statement.origin,state:
source: Cancelled
ca: Cancel·lat
es: Cancelado

# selection:account.statement.origin,state:
source: Posted
ca: Comptabilitzat
es: Contabilizado

# selection:account.statement.origin,state:
source: Registered
ca: Registrat
es: Registrado

# selection:account.statement.origin.suggested.line,state:
source: Proposed
ca: Proposat
es: Propuesto

# selection:account.statement.origin.suggested.line,state:
source: Used
ca: Utilitzat
es: Usado

# selection:account.statement.origin.suggested.line,type:
source: Balance
ca: Saldo
es: Saldo

# selection:account.statement.origin.suggested.line,type:
source: Balance Invoices
ca: Saldo de factures
es: Saldo de facturas

# selection:account.statement.origin.suggested.line,type:
source: Combine All
ca: Combinació de tot
es: Combinar todo

# selection:account.statement.origin.suggested.line,type:
source: Combine Parties
ca: Combinació de tercers
es: Combinar terceros

# selection:account.statement.origin.suggested.line,type:
source: Origin
ca: Origen
es: Origen

# selection:account.statement.origin.suggested.line,type:
source: Payment
ca: Pagament
es: Pago

# selection:account.statement.origin.suggested.line,type:
source: Payment Group
ca: Grup de pagaments
es: Grupo de pago

# selection:account.statement.origin.suggested.line,type:
source: Sale
es: Venta

# selection:enable_banking.configuration,date_field:
source: Booking Date
ca: Data reserva
es: Fecha reserva

# selection:enable_banking.configuration,date_field:
source: Transaction Date
ca: Data de transacció
es: Fecha transacción

# selection:enable_banking.configuration,date_field:
source: Value Date
ca: Data valor
es: Fecha valor

# selection:ir.cron,method:
source: Synchronize Enable Banking Journals
ca: Sincronitzar Diaris Enable Banking
es: Sincronizar Diarios Enable Banking

# view:account.invoice:
source: Tax
ca: Impost
es: Impuesto

# view:account.invoice:
source: Untaxed
ca: Base imposable
es: Base imponible

# view:account.move.line:
source: Total credit
ca: Haver total
es: Crédito total

# view:account.move.line:
source: Total debit
ca: Dèbit total
es: Débito total

# view:account.statement:
source: End Time
ca: Hora final
es: Hora final

# view:account.statement:
source: Start Time
ca: Hora inicial
es: Hora inicial

# view:enable_banking.origin_synchronize_statement.ask:
source: There are one or more Statement Journal with the Enable Banking Session expired. Do you want to go to the Origins or to the Journals to updat the sessions?
ca: Hi ha un o més diaris d'extractes amb la sessió d'Enable Banking caducada. Vols anar als Orígens o als Diaris per actualitzar les sessions?
es: Hay uno o más diarios de extracto con la sesión de Enable Banking caducada. ¿Quieres ir a los Orígenes o a los Diarios para actualizar las sesiones?

# view:enable_banking.retrieve_session.select_session:
source: A valid session has been found for the journal's bank account:
ca: S'ha trobat una sessió vàlida per al compte bancari del diari:
es: Se ha encontrado una sesión válida para la cuenta bancaria del diario:

# view:enable_banking.retrieve_session.select_session:
source: NOTE: Choosing to generate a new session will delete this existing one
ca: NOTA: Si es vol generar una sessió nova, s'eliminarà l'existent.
es: NOTA: Al escoger generar una nueva sesión se eliminará la existente.

# view:enable_banking.retrieve_session.start:
source: Do you want to continue?
ca: Vols continuar?
es: ¿Quieres continuar?

# view:enable_banking.retrieve_session.start:
source: Retrieve an enable banking session, creating one if it does not exist
ca: Recuperar una sessió bancària habilitada i crear-ne una si no existeix
es: Recupera una sesión bancaria habilitada, creando una si no existe

# view:enable_banking.session:
source: Bank
ca: Banc
es: Banco

# view:enable_banking.session:
source: Session
ca: Sessió
es: Sesión

# wizard_button:account.statement.origin.multiple.invoices,start,create_lines:
source: OK
ca: D'acord
es: De Acuerdo

# wizard_button:account.statement.origin.multiple.invoices,start,end:
source: Cancel
ca: Cancel·lar
es: Cancelar

# wizard_button:account.statement.origin.multiple.move_lines,start,create_lines:
source: OK
ca: D'acord
es: De Acuerdo

# wizard_button:account.statement.origin.multiple.move_lines,start,end:
source: Cancel
ca: Cancel·lar
es: Cancelar

# wizard_button:enable_banking.origin_synchronize_statement,ask,end:
source: Cancel
ca: Cancel·la
es: Cancela

# wizard_button:enable_banking.origin_synchronize_statement,ask,journal:
source: Journal
ca: Diaris
es: Diarios

# wizard_button:enable_banking.origin_synchronize_statement,ask,origin:
source: Origin
ca: Origens
es: Origenes

# wizard_button:enable_banking.retrieve_session,select_session,create_session:
source: Create New Session
ca: Crea una nova sessió
es: Crear nueva sesión

# wizard_button:enable_banking.retrieve_session,select_session,end:
source: Cancel
ca: Cancel·la
es: Cancelar

# wizard_button:enable_banking.retrieve_session,select_session,use_session:
source: Use Existing Session
ca: Utilitza la sessió existent
es: Usar sesión existente

# wizard_button:enable_banking.retrieve_session,start,check_session:
source: OK
ca: D'acord
es: Aceptar

# wizard_button:enable_banking.retrieve_session,start,end:
source: Cancel
ca: Cancel·la
es: Cancelar

# wizard_button:statement.link.invoice,start,apply:
source: Apply
ca: Aplica
es: Aplicar

# wizard_button:statement.link.invoice,start,end:
source: Cancel
ca: Cancel·la
es: Cancelar

# field:account.statement.origin,balance:
source: Balance
ca: Balanç

# model:ir.message,text:msg_origins_with_lines
source: The origins "%(origins)s" have lines. If you want to use them to pay an Invoice, you need to remvove this lines related.
ca: Els orígens "%(origins)s" tenen línies. Si voleu utilitzar-los per pagar una factura, heu d'eliminar aquestes línies relacionades.

# selection:account.statement.journal.weight,type:
source: Move Line Max Length
ca: Número màxim d'apunts

# view:account.statement.journal:
source: Synchronize Statements
ca: Sincronitza extractes
