Repository: NaN-tic/trytond-account_statement_enable_banking
Catalog: locale/*.po
Languages: ca, es

# field:account.invoice,paid_directly:
source: Has Payed directly
ca: Ha pagat directament
es: Ha pagado directamente

# field:account.move,allow_button_draft:
source: Allow Button Draft Move
ca: Permetre Botó d'esborrany d'assentament
es: Permitir botón borrador de asiento

# field:account.move,allow_draft:
source: Allow Draft Move
ca: Permetre assentament a esborrany
es: Permitir asiento a borrador

# field:account.move.line,debit_credit_balance:
source: Debit-Credit Balance
ca: Saldo dèbit-crèdit
es: Saldo Débito-Crédito

# field:account.move.line,payment_date:
source: Payment Date
ca: Data de pagament
es: Fecha de pago

# field:account.move.line,payment_group:
source: Payment Group
ca: Grup de pagament
es: Grupo de pago

# field:account.statement,end_date:
source: End Date
ca: Data final
es: Fecha final

# field:account.statement,start_date:
source: Start Date
ca: Data inicial
es: Fecha inicial

# field:account.statement.journal,account_statement_origin_sequence:
source: Account Statement Origin Sequence
ca: Seqüència d'Origen Extracte
es: Sequencia de Origen Extracto

# field:account.statement.journal,aspsp_country:
source: ASPSP Country
ca: País ASPSP
es: País ASPSP

# field:account.statement.journal,aspsp_name:
source: ASPSP Name
ca: Nom ASPSP
es: Nombre ASPSP

# field:account.statement.journal,enable_banking_session:
source: Enable Banking Session
ca: Sessió Enable Banking
es: Sesion Enable Banking

# field:account.statement.journal,enable_banking_session_allowed_bank_accounts:
source: Allowed Bank Accounts
ca: Comptes bancaris permesos
es: Cuentas bancarias permitidas

# field:account.statement.journal,max_amount_tolerance:
source: Max Amount tolerance
ca: Tolerància import màxim
es: Tolerancia de importe máximo

# field:account.statement.journal,offset_days_to:
source: Offset Days To
ca: Dies marge fins a
es: Días de margen hasta

# field:account.statement.journal,one_move_per_origin:
source: One Move per Origin
ca: Un assentament per origen
es: Un asiento por origen

# field:account.statement.journal,synchronize_journal:
source: Synchronize Journal
ca: Sincronitzar diari
es: Sincronizar diario

# field:account.statement.journal,weights:
source: Weights
ca: Pesos
es: Pesos

# field:account.statement.journal.weight,journal:
source: Journal
ca: Diari
es: Diario

# field:account.statement.journal.weight,type:
source: Type
ca: Tipus
es: Tipo

# field:account.statement.journal.weight,weight:
source: Weight
ca: Pes
es: Peso

# field:account.statement.line,account_required:
source: Account Required
es: Cuenta requerida

# field:account.statement.line,analytic_accounts:
source: Analytic Accounts
ca: Comptes analítics
es: Cuentas analíticas

# field:account.statement.line,analytic_accounts_size:
source: Analytic Accounts Size
ca: Mida dels comptes analítics
es: Tamaño de las cuentas analíticas

# field:account.statement.line,maturity_date:
source: Maturity Date
ca: Data de venciment
es: Fecha de vencimiento

# field:account.statement.line,origin_state:
source: Origin State
ca: Estat d'origen
es: Estado de origen

# field:account.statement.line,show_paid_invoices:
source: Show Paid Invoices
ca: Mostra les factures pagades
es: Mostrar facturas pagadas

# field:account.statement.line,suggested_line:
source: Suggested Line
ca: Línia suggerida
es: Línea sugerida

# field:account.statement.origin,entry_reference:
source: Entry Reference
ca: Referència d'entrada
es: Referencia de entrada

# field:account.statement.origin,journal:
source: Journal
es: Diario

# field:account.statement.origin,remittance_information:
source: Remittance Information
ca: Informació del banc
es: Información del banco

# field:account.statement.origin,state:
source: State
ca: Estat
es: Estado

# field:account.statement.origin,suggested_lines:
source: Suggested Lines
ca: Línies suggerides
es: Líneas sugeridas

# field:account.statement.origin,suggested_lines_tree:
source: Suggested Lines
ca: Línies suggerides
es: Líneas sugeridas

# field:account.statement.origin,synchronized:
source: Synchronized
ca: Sincronitzat
es: Sincronizado

# field:account.statement.origin.multiple.invoices.start,amount:
source: Amount
ca: Import
es: Importe

# field:account.statement.origin.multiple.invoices.start,company:
source: Company
ca: Companyia
es: Compañía

# field:account.statement.origin.multiple.invoices.start,currency:
source: Currency
ca: Moneda
es: Moneda

# field:account.statement.origin.multiple.invoices.start,invoices:
source: Invoices
ca: Factures
es: Facturas

# field:account.statement.origin.multiple.invoices.start,pending_amount:
source: Pending Amount
ca: Import pendent
es: Importe pendiente

# field:account.statement.origin.multiple.move_lines.start,amount:
source: Amount
ca: Import
es: Importe

# field:account.statement.origin.multiple.move_lines.start,company:
source: Company
ca: Companyia
es: Compañía

# field:account.statement.origin.multiple.move_lines.start,currency:
source: Currency
ca: Moneda
es: Moneda

# field:account.statement.origin.multiple.move_lines.start,move_lines:
source: Move Lines
ca: Apunts
es: Apuntes

# field:account.statement.origin.multiple.move_lines.start,pending_amount:
source: Pending Amount
ca: Import pendent
es: Importe pendiente

# field:account.statement.origin.multiple.move_lines.start,second_currency:
source: Second Currency
ca: Segona moneda
es: Segunda moneda

# field:account.statement.origin.suggested.line,account:
source: Account
ca: Compte
es: Cuenta

# field:account.statement.origin.suggested.line,amount:
source: Amount
ca: Import
es: Importe

# field:account.statement.origin.suggested.line,amount_second_currency:
source: Amount Second Currency
ca: Import Segona moneda
es: Importe Segunda Moneda

# field:account.statement.origin.suggested.line,analytic_accounts:
source: Analytic Accounts
ca: Comptes analítics
es: Cuentas analíticas

# field:account.statement.origin.suggested.line,analytic_accounts_size:
source: Analytic Accounts Size
ca: Mida dels comptes analítics
es: Tamaño de las cuentas analíticas

# field:account.statement.origin.suggested.line,based_on:
source: Based On
ca: Basat en
es: Basado en

# field:account.statement.origin.suggested.line,childs:
source: Children
ca: Fills
es: Hijos

# field:account.statement.origin.suggested.line,company:
source: Company
ca: Companyia
es: Compañía

# field:account.statement.origin.suggested.line,company_currency:
source: Company Currency
ca: Moneda de l'empresa
es: Moneda de la empresa

# field:account.statement.origin.suggested.line,currency:
source: Currency
ca: Moneda
es: Moneda

# field:account.statement.origin.suggested.line,date:
source: Date
ca: Data
es: Fecha

# field:account.statement.origin.suggested.line,origin:
source: Origin
ca: Origen
es: Origen

# field:account.statement.origin.suggested.line,parent:
source: Parent
ca: Pare
es: Padre

# field:account.statement.origin.suggested.line,party:
source: Party
ca: Tercer
es: Tercero

# field:account.statement.origin.suggested.line,related_to:
source: Related To
ca: Relacionat amb
es: Relacionado con

# field:account.statement.origin.suggested.line,second_currency:
source: Second Currency
ca: Segona moneda
es: Segunda moneda

# field:account.statement.origin.suggested.line,state:
source: State
ca: Estat
es: Estado

# field:account.statement.origin.suggested.line,type:
source: Type
ca: Tipus
es: Tipo

# field:account.statement.origin.suggested.line,weight:
source: Weight
ca: Pes
es: Peso

# field:enable_banking.configuration,date_field:
source: Date Field
ca: Camp data
es: Campo fecha

# field:enable_banking.configuration,offset:
source: Offset Days
ca: Dies de offset
es: Días de Offset

# field:enable_banking.configuration,redirecturl:
source: Redirect URL
ca: URL de redireccionament
es: URL de redireccionamiento

# field:enable_banking.origin_synchronize_statement.ask,journals:
source: Journals
ca: Diaris
es: Diarios

source: Enable Banking Session Valid
ca: Sessió vàlida Enable Banking
es: Sesión válida Enable Banking

source: Enable Banking Session Valid Days
ca: Dies de sessió vàlida Enable Banking
es: Días de sesión vàlida Enable Banking

# field:enable_banking.retrieve_session.select_session,found_session:
source: Found Session
ca: Sessió trobada
es: Sesión encontrada

# field:enable_banking.retrieve_session.start,enable_banking_session_valid:
source: Enable Banking Session Valid
ca: Sessió vàlida Enable Banking
es: Sesión válida Enable Banking

# field:enable_banking.retrieve_session.start,enable_banking_session_valid_days:
source: Enable Banking Session Valid Days
ca: Dies de sessió vàlida Enable Banking
es: Días de sesión vàlida Enable Banking

# field:enable_banking.session,allowed_bank_accounts:
source: Allowed Bank Accounts
ca: Comptes bancaris permesos
es: Cuentas bancarias permitidas

# field:enable_banking.session,aspsp_country:
source: ASPSP Country
ca: País ASPSP
es: País ASPSP

# field:enable_banking.session,aspsp_name:
source: ASPSP Name
ca: Nom ASPSP
es: Nombre ASPSP

# field:enable_banking.session,bank:
source: Bank
ca: Banc
es: Banco

# field:enable_banking.session,encrypted_session:
source: Encrypted Session
ca: Sessió xifrada
es: Sesión cifrada

# field:enable_banking.session,session:
source: Session
ca: Sessió
es: Sesión

# field:enable_banking.session,session_id:
source: Session ID
ca: ID sessió
es: ID Sesión

# field:enable_banking.session,valid_until:
source: Valid Until
ca: Vàlid fins a
es: Valido hasta

# field:statement.link.invoice.start,company:
source: Company
ca: Empresa
es: Compañía

# field:statement.link.invoice.start,currency:
source: Currency
ca: moneda
es: Moneda

# field:statement.link.invoice.start,diff_amount:
source: Difference Amount
ca: Diferència
es: Diferencia

# field:statement.link.invoice.start,invoice:
source: Invoice
ca: Factura
es: Factura

# field:statement.link.invoice.start,invoice_amount:
source: Invoice Amount
ca: Import factura
es: Importe factura

# field:statement.link.invoice.start,origins_amount:
source: Origins Amount
ca: Import orígens
es: Importe Orígenes

# field:statement.link.invoice.start,post_origin:
source: Post Origins
ca: Comptabilitzar Origens
es: Contabilizar Origens

# help:account.invoice,paid_directly:
source: The invoice has payed with the 'PAY' button
ca: La factura s'ha pagat amb el botó "PAGAR"
es: La factura se ha pagado con el botón 'PAGAR'

# help:account.statement.journal,max_amount_tolerance:
source: In some cases, it is possible to have amounts that vary in X. This field if set is the maximum of the allowed tolerance. That is, if value is set when searching for similarities it will look for equal amounts or with +X, value that has been set here.
ca: En alguns casos, és possible tenir imports que varien en X. Aquest camp, si s'estableix, és el màxim de la tolerància permesa. És a dir, si s'estableix un valor en cercar similituds, buscarà imports iguals o amb +X, valor que s'ha establert aquí.
es: En algunos casos, es posible tener importes que varían en X. Este campo si está configurado es el máximo de la tolerancia permitida. Es decir, si se pone valor al buscar similitudes se buscarán importes iguales o con +X, valor que se ha puesto aquí.

# help:account.statement.journal,offset_days_to:
source: Default offset days in the Bank transaction search. Allow to not download "to" today, could be set "to" some days before. This field could be from 0 to 20. 0 meaning today, other value will be substracted from today.
ca: Dies de marge per defecte a la cerca de transaccions bancàries. Permet no descarregar "a" avui, es pot establir "a" uns dies abans. Aquest camp pot ser de 0 a 20. 0 significa avui, l'altre valor es restarà d'avui.
es: Días de margen predeterminados en la búsqueda de transacciones bancarias. Se permite no descargar hasta hoy; se puede configurar hasta algunos días antes. Este campo puede tener un valor de 0 a 20. 0 significa hoy; cualquier otro valor se restará del día de hoy.

# help:account.statement.journal,one_move_per_origin:
source: Check if want to create only one move per origin when post it even it has more than one line. Else it create one move for eaach line.
ca: Marca si vols crear només un assentmanet per origen quan el comptabilitzes encara que tingui més d'una línia. En cas contrari, crea un moviment per a cada línia.
es: Marca si quieres crear solo un asiento por origen cuando lo publique, incluso si tiene más de una línea. De lo contrario, crea un movimiento para cada línea.

# help:account.statement.journal,synchronize_journal:
source: Check if want to synchronize automatically. When is automatically the offset is not used and tak the las statement synched date.
ca: Marcar si voleu sincronitzar automàticament. Quan és automàticament no s'utilitza l'offset i agafa la data de sincronització de l'últim extracte.
es: Marcar si se quiere sincronizar automáticamente. Cuando es automático, el offset no se utiliza y se toma la última fecha sincronizada de los extractos

# help:account.statement.line,maturity_date:
source: Set a date to make the line payable or receivable.
ca: Establiu una data per fer la línia a pagar o a cobrar.
es: Fijar una fecha para hacer la línea a pagar o a cobrar.

# help:enable_banking.configuration,date_field:
source: Choose which date to use when importing statements
ca: Escull quina data utilitzar quan s'importen els extractes
es: Escoge que fecha utilizar al importar extractos.

# help:enable_banking.configuration,offset:
source: Offset in days to apply when importing statements manually
ca: Offset en dies per aplicar en importar extractes manualment
es: Offset en días que se aplicará al importar extractos manualmente

source: Only allowed maximum 180 days.
ca: Només es permeten un màxim de 180 dies.
es: Solo se permite un máximo de 180 días.

# help:enable_banking.retrieve_session.start,enable_banking_session_valid_days:
source: Only allowed maximum 180 days.
ca: Només es permeten un màxim de 180 dies.
es: Solo se permite un máximo de 180 días.

# model:account.statement.journal.weight,name:
source: Journal Weight
ca: Pes Diari
es: Peso Diario

# model:account.statement.origin.information,string:eb_balance_after_transaction
source: Balance After Transaction
ca: Saldo després de la transacció
es: Saldo después de la transacción

# model:account.statement.origin.information,string:eb_bank_transaction_code_code
source: Bank Transaction Code
ca: Codi de transacció bancària
es: Código de transacción bancaria

source: Bank Transaction Code Description
ca: Descripció del codi de transacció bancària
es: Descripción del código de transacción bancaria

source: Bank Transaction Code Sub Code
ca: Subcodi del codi de transacció bancària
es: Subcódigo del código de transacción bancaria

# model:account.statement.origin.information,string:eb_booking_date
source: Booking Date
ca: Data reserva
es: Fecha reserva

# model:account.statement.origin.information,string:eb_credit_debit_indicator
source: Credit Debit Indicator
ca: Indicador de dèbit de crèdit
es: Indicador de débito de crédito

source: Creditor Account Additional Identification
ca: Informació addicional del compte de creditor.
es: Información adicional de la cuenta acreedor

# model:account.statement.origin.information,string:eb_creditor_account_iban
source: Creditor Account IBAN
ca: IBAN del compte creditor
es: IBAN de cuenta de acreedor

# model:account.statement.origin.information,string:eb_creditor_account_other
source: Creditor Account Other
ca: Un altre compte creditor
es: Otra cuenta de acreedor

# model:account.statement.origin.information,string:eb_creditor_agent_bic_fi
source: Creditor Agent BIC FI
ca: Agent creditor BIC FI
es: Agente Acreedor BIC FI

# model:account.statement.origin.information,string:eb_creditor_agent_name
source: Creditor Agent Name
ca: Nom de l'agent creditor
es: Nombre del agente acreedor

# model:account.statement.origin.information,string:eb_creditor_name
source: Creditor Name
ca: Nom del creditor
es: Nombre del acreedor

# model:account.statement.origin.information,string:eb_creditor_postal_address
source: Creditor Postal Address
ca: Adreça postal del creditor
es: Dirección postal del acreedor

source: Debtor Account Additional Identification
ca: Informació addicional del compte de deutor
es: Identificación adicional de la cuenta deudora

# model:account.statement.origin.information,string:eb_debtor_account_iban
source: Debtor Account IBAN
ca: IBAN del compte deutor
es: IBAN de la cuenta del deudor

# model:account.statement.origin.information,string:eb_debtor_account_other
source: Debtor Account Other
ca: Un altre compte deutor
es: Otra cuenta Deudora

# model:account.statement.origin.information,string:eb_debtor_agent_bic_fi
source: Debtor Agent BIC FI
ca: Agent deutor BIC FI
es: Agente Deudor BIC FI

# model:account.statement.origin.information,string:eb_debtor_agent_name
source: Debtor Agent Name
ca: Nom de l'agent deutor
es: Nombre del agente deudor

# model:account.statement.origin.information,string:eb_debtor_name
source: Debtor Name
ca: Nom del deutor
es: Nombre del deudor

# model:account.statement.origin.information,string:eb_debtor_postal_address
source: Debtor Postal Address
ca: Adreça postal del deutor
es: Dirección postal del deudor

# model:account.statement.origin.information,string:eb_exchange_rate
source: Exchange Rate
ca: Tassa de canvi
es: Tasa de cambio

source: Exchange Rate Contract Identification
ca: Identificació del contracte de tipus de canvi
es: Identificación del contrato de tipo de cambio

# model:account.statement.origin.information,string:eb_exchange_rate_exchange_rate
source: Exchange Rate
ca: Tipus de canvi
es: Tipo de cambio

source: Exchange Rate Instructed Amount
ca: Import del tipus de canvi
es: Importe del tipo de cambio

# model:account.statement.origin.information,string:eb_exchange_rate_rate_type
source: Exchange Rate Type
ca: Tipus de tipus de canvi
es: Tipo de tipo de cambio

# model:account.statement.origin.information,string:eb_exchange_rate_unit_currency
source: Exchange Rate Unit Currency
ca: Moneda de tipus de canvi
es: Moneda de tipo de cambio

# model:account.statement.origin.information,string:eb_merchant_category_code
source: Merchant Category Code
ca: Codi de categoria de comerciant
es: Código de categoría de comerciante

# model:account.statement.origin.information,string:eb_note
source: Note
ca: Nota
es: Nota

# model:account.statement.origin.information,string:eb_reference_number
source: Reference Number
ca: Número de referència
es: Número de referencia

# model:account.statement.origin.information,string:eb_remittance_information
source: Remittance Information
ca: Informació enviament
es: Información envío

# model:account.statement.origin.information,string:eb_status
source: Status
ca: Estat
es: Estado

# model:account.statement.origin.information,string:eb_transaction_amount
source: Transaction Amount
ca: Import de transacció
es: Importe de transacción

# model:account.statement.origin.information,string:eb_transaction_date
source: Transaction Date
ca: Data de transacció
es: Fecha transacción

# model:account.statement.origin.information,string:eb_value_date
source: Value Date
ca: Data valor
es: Fecha valor

# model:account.statement.origin.multiple.invoices.start,name:
source: Add Multiple Invoices Start
ca: Afegiu Diverses Factures Inici
es: Agregar Múltiples Facturas Inico

# model:account.statement.origin.multiple.move_lines.start,name:
source: Add Multiple Move Lines Start
ca: Afegiu Diversos Apunts Inici
es: Agregar múltiples Apuntes Inicio

# model:account.statement.origin.suggested.line,name:
source: Account Statement Origin Suggested Line
ca: Línia Suggerida Origen Extracte
es: Línea Sugerida Origen Extracte

# model:enable_banking.configuration,name:
source: Enable Banking Configuration
ca: Configuració Enable Banking
es: Configuración

# model:enable_banking.origin_synchronize_statement.ask,name:
source: Statement Origin or Synchronize Statement Enable Banking Ask
ca: Orígen de l'extracte o Sincronitzar extracte Enable Banking Pregunta
es: Origen del extracto o Sincronizar extracto Enable Banking Pregunta

# model:enable_banking.retrieve_session.select_session,name:
source: Retrieve Enable Banking Session Select Session
ca: Escull Sessió Recupera sessión Enable Banking
es: Escoge sesión Recupera sesión Enable Banking

# model:enable_banking.retrieve_session.start,name:
source: Retrieve Enable Banking Session Start
ca: Inici Recupera sessión Enable Banking
es: Inicio Recupera sesión Enable Banking

# model:enable_banking.session,name:
source: Enable Banking Session
ca: Sessió Enable Banking
es: Sesión Enable Banking

# model:ir.action,name:
source: Synchronize Statement Enable Banking
ca: Sincronitza extractes a través d'Enable Banking
es: Sincroniza Extractos a través de Enable Banking

# model:ir.action,name:act_account_statement_origin_suggested_line_view
source: Account Statement Origin Suggested Line
ca: Línia Suggerida Origen Extracte
es: Línea Sugerida Origen Extracte

# model:ir.action,name:act_enable_banking_configuration_form
source: Enable Banking Configuration
ca: Configuració Enable Banking
es: Configuración

# model:ir.action,name:act_enable_banking_retrieve_session
source: Synchronize Statement Enable Banking
ca: Sincronitza extracte Enable Banking
es: Sincronizar extractos Enable Banking

# model:ir.action,name:act_enable_banking_session_form
source: Enable Banking Session
ca: Sessió Enable Banking
es: Sesión Enable Banking

# model:ir.action,name:act_origin_move_lines_form
source: Move Lines
ca: Apunts
es: Apuntes

# model:ir.action,name:act_origin_moves_form
source: Moves
ca: Assentaments
es: Asientos

# model:ir.action,name:act_origin_synchronize_statement
source: Statement Origins
ca: Orígens de l'extracte
es: Orígenes del extracto

# model:ir.action,name:act_statement_origin_form
source: Statement Origins
ca: Origens d'extracte
es: Origenes de extracto

# model:ir.action,name:report_session_ko
source: Enable Banking Session KO
ca: Sessió Enable Banking KO
es: Sesión Enable Banking KO

# model:ir.action,name:report_session_ok
source: Enable Banking Session OK
ca: Sessió Enable Banking OK
es: Enable Banking Sesión OK

# model:ir.action,name:url_session
source: Enable Banking Session
ca: Sessió Enable Banking
es: Sessión Enable Banking

# model:ir.action,name:wizard_link_invoice
source: Link Invoice
ca: Enllaça factura
es: Enlaza factura

# model:ir.action,name:wizard_multiple_invoices
source: Add Multiple Invoices
ca: Afegeix Diverses Factures
es: Agregar Múltiples Facturas

# model:ir.action,name:wizard_multiple_move_lines
source: Add Multiple Move Lines
ca: Afegeix Diversos Apunts
es: Agregar Múltiples Apuntes

# model:ir.action.act_window.domain,name:act_statement_form_domain_registered
source: Registered
ca: Registrat
es: Registrado

# model:ir.action.act_window.domain,name:act_statement_origin_form_domain_all
source: All
ca: Tot
es: Todo

# model:ir.action.act_window.domain,name:act_statement_origin_form_domain_posted
source: Posted
ca: Comptabilitzat
es: Contabilizado

source: Registered
ca: Registrat
es: Registrado

# model:ir.message,text:msg_account_not_found
source: Account "%(account)s" not found in session from bank "%(bank)s" make sure the account number is correct.
ca: El compte "%(account)s" no s'ha trobat a la sessió del banc "%(bank)s" comprova que el número de compte sigui correcte.
es: La cuenta "%(account)s" no se ha encontrado en la sesión del banco "%(bank)s" comprueba que el número de cuenta es correcto.

# model:ir.message,text:msg_aspsp_not_found
source: Bank "%(bank)s" from country "%(country_code)s" not found in Enable Banking compatible banks.\n%(message)s
ca: No s'ha trobat el banc "%(bank)s" del país "%(country_code)s" com a compatible amb Enable Banking.\n%(message)s
es: El banco "%(bank)s" del país "%(country_code)s" no es compatbile con Enable Banking.\n%(message)s
